In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#Lets start by making two series
ser1 = Series([0,1,2], index = ['A','B','C'])
#Show
ser1

A    0
B    1
C    2
dtype: int64

In [5]:
#Now second Series
ser2 = Series([3,4,5,6],index = ['A','B','C','D'])
#Show
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [6]:
#So what happens when we add these together
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [15]:
# Now let's try it with DataFrames!
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'), index=['NYC','LA'])
#Show
dframe1

     A  B
NYC  0  1
LA   2  3

In [16]:
#Second DataFrame
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])

#Show
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [17]:
#What happens when we add them together?

dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [18]:
#What if we want to replace the NaN values
# Then we can use .add()

dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [19]:
#Now we can see that the values are filled, however there was no SF,B value so that is still NaN

In [20]:
#Lets learn about operations betwen a Series and a DataFrame

In [21]:

#Show
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [25]:
#Create a Series from DataFrame's 0 row
ser3 = dframe2.iloc[0]

#Show
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [26]:
#Now we can use arithmetic operations
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [27]:
#Next we'll learn about sorting and ranking!